&НаСервере
Процедура ПриОткрытииНаСервере()
Объект.Врач = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
Документ = Объект;
ТабличныйДокумент = ПослеЗаписиНа(Документ);
ТабличныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ПослеЗаписиНа(Объект)
Если Объект.Проведен = Истина Тогда
ТабличныйДокумент = Новый ТабличныйДокумент;
Макет = Документы.ПротоколОсмотраПациентов.ПолучитьМакет("Макет");

Шапка = Макет.ПолучитьОбласть("Шапка");
ТабличныйДокумент.Вывести(Шапка);
Информация = Макет.ПолучитьОбласть("Информация");

Информация.Параметры.Пациент = Объект.Пациент;
Информация.Параметры.Возраст = Объект.Возраст;
Информация.Параметры.НомерДокумента = Объект.НомерДокумента;
Информация.Параметры.Палата = Объект.Палата;
Информация.Параметры.ДатаВремя = Объект.ДатаВремя;
Информация.Параметры.Жалобы = Объект.Жалобы;
Информация.Параметры.ОбщийСтатус = Объект.ОбщийСтатус;
Информация.Параметры.ДиагнозОсновной = Объект.ДиагнозОсновной;
Информация.Параметры.ДиагнозСопутствующий = Объект.ДиагнозСопутствующий;
Информация.Параметры.НазначенияИРекомендации = Объект.НазначенияИРекомендации;

ТабличныйДокумент.Вывести(Информация);
Подвал = Макет.ПолучитьОбласть("Подвал");

Подвал.Параметры.Врач = Объект.Врач;
Подвал.Параметры.ЗавОРИТ = Объект.ЗавОРИТ;

ТабличныйДокумент.Вывести(Подвал);

Возврат ТабличныйДокумент;
КонецЕсли;
КонецФункции