
&НаКлиенте
Процедура ПолучитьСписокПациентов(Команда)
	ПолучитьСписокПациентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПациентовНаСервере()
	Соединение = Новый HTTPСоединение("localhost/my_base",,"Администратор");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Пациент");
	Ответ = Соединение.ВызватьHTTPМетод("GET",Запрос);
	Если Ответ.КодСостояния = 200 Тогда               
		//Сообщить(Ответ.ПолучитьТелоКакСтроку());
		Парсер = Новый ЧтениеXML;
		Парсер.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		
		Построитель = Новый ПостроительDOM;
		
		Документ = Построитель.Прочитать(Парсер);
		
		Результат = "Пациенты: " + Символы.ПС;
		Для Каждого Элемент0 Из Документ.ДочерниеУзлы Цикл
			
			Для Каждого Элемент1 Из Элемент0.ДочерниеУзлы Цикл
				
				Если Элемент1.ИмяУзла = "entry" Тогда
					
					entry = Элемент1;
					
					Для Каждого Элемент11 Из entry.ДочерниеУзлы Цикл
						
						Если Элемент11.ИмяУзла = "content" Тогда
							
							content = Элемент11;
							
							Для Каждого Элемент111 Из content.ДочерниеУзлы Цикл
								
								Если Элемент111.ИмяУзла = "m:properties" Тогда
									
									properties = Элемент111;
									
									Для Каждого Элемент1111 Из properties.ДочерниеУзлы Цикл
										
										Если Элемент1111.ИмяУзла = "d:Description" Тогда
											Результат = Результат + Элемент1111.ТекстовоеСодержимое + Символы.ПС;	
										КонецЕсли;
										
									КонецЦикла;
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		Сообщить(Результат);
	Иначе
		Сообщить(Ответ.КодСостояния);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПациента(Команда)
	Если НЕ ПустаяСтрока(ИмяПациента) Тогда
		ДобавитьПациентаНаСервере();
		Сообщить("Модель успешно добавлена");
	Иначе
	    Сообщить("Введите наименование модели для добавления");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПациентаНаСервере()
	Соединение = Новый HTTPСоединение("localhost/my_base",,"Администратор");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Пациент?$format=json");
	СтрокаJSON = "{""Description"":"""+ИмяПациента+"""}";	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ = Соединение.ВызватьHTTPМетод("POST",Запрос);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПациента(Команда)
	ИзменитьПациентаНаСервере();
	Сообщить("Данные обновлены");
КонецПроцедуры

&НаСервере
Процедура ИзменитьПациентаНаСервере()
	Соединение = Новый HTTPСоединение("localhost/my_base",,"Администратор");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Пациент(guid'"+Строка(Пациент.УникальныйИдентификатор())+"')?$format=json");	
	СтрокаJSON = "{""Description"":"""+НовоеИмя+"""}";	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ = Соединение.ВызватьHTTPМетод("PATCH",Запрос);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПациента(Команда)
	УдалитьПациентаНаСервере();
	Сообщить("Удаление завершено");
КонецПроцедуры

&НаСервере
Процедура УдалитьПациентаНаСервере() 
	Соединение = Новый HTTPСоединение("localhost/my_base",,"Администратор");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Пациент(guid'"+Строка(ПациентНаУдаление.УникальныйИдентификатор())+"')");
	Ответ = Соединение.ВызватьHTTPМетод("DELETE",Запрос);
КонецПроцедуры
